#задание 1
#ввод
"""num = int(input("Введите число -> "))
if (num % 2 == 0) : # определение четности числа
    print(f"Число четное")
else :
    print(f"Число нечетное")  
if (num % 3 == 0) : # определение кратно ли число 3
    print(f"Число делится на 3")
else :
    print(f"Число не делится на 3") 
if (num < 0) : #определение знака числа
    print(f"Число отрицательное")
elif (num > 0):
    print(f"Число положительное") 
else:
    print(f"Число является нулем")

#задание 2
#ввод данных
a = float(input("Введите первое число -> "))
b = float(input("Введите второе число -> "))
c = float(input("Введите третье число -> "))

#определение наибольшего числа
if (a >= b) and (a >= c):
    print(f"Наибольшее число {a}") #вывод результата
elif (b >= a) and (b >= c):
    print(f"Наибольшее число {b}") #вывод результата
else:
    print(f"Наибольшее число {c}") #вывод результата

#альтернативный способ решения
print("---------------")
max_num = max(a, b, c)
print(f"Наибольшее число {max_num}")

#задание 3
#ввод данных
age = int(input("Введите ваш возраст -> "))
#определение категории возраста
if (age < 0):
    print("Вы ввели некорректный возраст")
elif (age <= 12):
    print("Вы ребенок")
elif (age <= 17):
    print("Вы подросток")
elif (age <= 64):
    print("Вы взрослый")
else:
    print("Вы пожилой")

#задание 4
#импорт библиотеки
import math
#ввод данных
print("Квадратное уравнение имеет вид: ax^2 + bx + c = 0")
print("Введите коэффициенты a, b и c")
a = float(input("Введите число a -> "))
b = float(input("Введите число b -> "))
c = float(input("Введите число c -> "))
#проверка на ноль
if (a == 0):
    print("это не квадратное уравнение")
#вычисление дискриминанта
else:
    D = b**2 - 4*a*c
    if D > 0:
        x1 = (-b + math.sqrt(D)) / (2*a)
        x2 = (-b - math.sqrt(D)) / (2*a)
        print(f"Дискриминант = {D}")
        print(f"Корни: x1 = {x1}, x2 = {x2}")
    elif D == 0:
        x = -b / (2*a)
        print(f"Дискриминант = {D}")
        print(f"Корень: x = {x}")
    else:
        print(f"Дискриминант = {D}")
        print("Корней нет")

#Задание 5
#ввод данных
a = float(input("Введите первое число -> "))
b = float(input("Введите второе число -> "))
operator = input("Введите операцию (+, -, *, /) -> ").strip()
#oпределение операции и выполнение вычислений
match operator:
    case "+":
        print(f"Результат: {a + b}")
    case "-":
        print(f"Результат: {a - b}")
    case "*":
        print(f"Результат: {a * b}")
    case "/":
        if b != 0:
            print(f"Результат: {a / b:.2f}")
        else:
            print("Ошибка: деление на ноль")
    case _:
        print("Ошибка: неизвестная операция")"""