#задание 1
#ввод
"""num = int(input("Введите число -> "))
if (num % 2 == 0) : # определение четности числа
    print(f"Число четное")
else :
    print(f"Число нечетное")  
if (num % 3 == 0) : # определение кратно ли число 3
    print(f"Число делится на 3")
else :
    print(f"Число не делится на 3") 
if (num < 0) : #определение знака числа
    print(f"Число отрицательное")
elif (num > 0):
    print(f"Число положительное") 
else:
    print(f"Число является нулем") """

#задание 2
#ввод данных
a = float(input("Введите первое число -> "))
b = float(input("Введите второе число -> "))
c = float(input("Введите третье число -> "))

#определение наибольшего числа
if (a >= b) and (a >= c):
    print(f"Наибольшее число {a}") #вывод результата
elif (b >= a) and (b >= c):
    print(f"Наибольшее число {b}") #вывод результата
else:
    print(f"Наибольшее число {c}") #вывод результата

#альтернативный способ решения
print("---------------")
max_num = max(a, b, c)
print(f"Наибольшее число {max_num}")